maybecat-wow/esp32-breathing/main/app_main.c
/*
 * SPDX-FileCopyrightText: 2026 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
/* Get recv router csi — TCP output edition

   Architecture overview
   ─────────────────────
   Wi-Fi task (highest priority)
     └─ wifi_csi_rx_cb()  ← called per beacon/ping by the Wi-Fi driver
           │  builds one CSV row into a stack buffer (no mutex, no send)
           └─ xStreamBufferSend()  ← non-blocking; drops frame if full
                  │
                  ▼  (StreamBuffer, 8 KB)
   tcp_writer_task (priority 5)
     └─ xStreamBufferReceive() → tcp_send_locked() → send()
          (only task that ever blocks on TCP back-pressure)

   tcp_reconnect_task (priority 3)
     └─ maintains TCP socket, sends CSV header on (re-)connect,
        emits 1 Hz heartbeat, logs CSI frame counters every 5 s

   This two-task design keeps the Wi-Fi task free of TCP back-pressure.
   If the network stalls, the 8 KB stream buffer absorbs ~10 rows; frames
   beyond that are dropped (counted in s_csi_frames_dropped) rather than
   blocking the Wi-Fi task and risking beacon loss.

   Menuconfig (idf.py menuconfig → CSI Breathing Monitor):
     CONFIG_CSI_TCP_HOST    — host IP of the capture machine
     CONFIG_CSI_TCP_PORT    — TCP port (default 3490)
     CONFIG_SEND_FREQUENCY  — ping / CSI sample rate in Hz (default 100)

   Defaults are set in main/Kconfig.projbuild.

   Wi-Fi provisioning:
     First boot: device enters ESPTouch v1 (SmartConfig) mode.
     Use the Espressif EspTouch app to push credentials. They are saved
     to NVS and reused on subsequent boots. Credentials are NEVER erased
     after the first successful association — transient AP glitches during
     overnight captures will not trigger re-provisioning.
*/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "freertos/semphr.h"
#include "freertos/stream_buffer.h"

#include "nvs_flash.h"
#include "nvs.h"

#include "esp_mac.h"
#include "rom/ets_sys.h"
#include "esp_log.h"
#include "esp_wifi.h"
#include "esp_netif.h"
#include "esp_event.h"
#include "esp_now.h"
#include "esp_smartconfig.h"
#include "esp_timer.h"

#include "lwip/inet.h"
#include "lwip/netdb.h"
#include "lwip/sockets.h"
#include "lwip/err.h"
#include "ping/ping_sock.h"

#include "esp_csi_gain_ctrl.h"

/* ── Configuration ──────────────────────────────────────────────────────── */

/* CONFIG_SEND_FREQUENCY, CONFIG_CSI_TCP_HOST, and CONFIG_CSI_TCP_PORT are
 * provided by Kconfig (main/Kconfig.projbuild) and configurable via
 * idf.py menuconfig under "CSI Breathing Monitor". */

/* How large a single CSV line can be.
   Worst case: header (~120 B) + 128 CSI bytes as "%d," (~640 B) + overhead */
#define TCP_TX_BUF_SIZE         1024

/* Exponential backoff for TCP reconnection (milliseconds). Starts at
   TCP_RECONNECT_BACKOFF_MIN_MS after a failure, doubles on each failure, caps
   at TCP_RECONNECT_BACKOFF_MAX_MS. Resets to MIN on a successful connect. */
#define TCP_RECONNECT_BACKOFF_MIN_MS    500
#define TCP_RECONNECT_BACKOFF_MAX_MS    30000

/* Poll interval while the TCP connection is up. The reconnect task wakes
   at this rate to check whether a heartbeat is due and to log frame stats. */
#define TCP_CONNECTED_POLL_MS           500

/* Heartbeat line is emitted when this long has passed since the last send. */
#define TCP_HEARTBEAT_INTERVAL_US       1000000  /* 1 s */

/* Wi-Fi reconnect backoff (milliseconds). Never erases NVS once we have
   successfully associated at least once — transient AP glitches overnight
   must not wipe credentials. */
#define WIFI_RECONNECT_BACKOFF_MIN_MS   500
#define WIFI_RECONNECT_BACKOFF_MAX_MS   30000

/* Auth-class failures (wrong password) allowed *before the first ever
   successful association* before NVS is erased and ESPTouch is triggered.
   After first successful assoc, NVS is never erased automatically — only
   idf.py erase-flash can reset credentials. */
#define WIFI_AUTH_FAIL_THRESHOLD        5

#if CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C61
#define CSI_FORCE_LLTF          0
#endif

#define CONFIG_FORCE_GAIN       0

#if CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3 || \
    CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6  || \
    CONFIG_IDF_TARGET_ESP32C61
#define CONFIG_GAIN_CONTROL     1
#endif

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
#define ESP_IF_WIFI_STA ESP_MAC_WIFI_STA
#endif

static const char *TAG = "csi_recv_router";

/* ── TCP + Wi-Fi state ──────────────────────────────────────────────────── */

static int          s_tcp_sock   = -1;          /* socket fd, -1 = disconnected */
static SemaphoreHandle_t s_tcp_mutex = NULL;    /* guards all fields below      */
static bool         s_header_sent = false;      /* have we sent the CSV header?  */
static int64_t      s_last_tx_us  = 0;          /* esp_timer_get_time() of last successful send */

/* Observability fields for the periodic heartbeat line. Updated from the
   Wi-Fi event handler; read from tcp_reconnect_task under s_tcp_mutex. */
static uint32_t     s_reconnect_count  = 0;     /* Wi-Fi associations since boot */
static int          s_last_disc_reason = 0;     /* last WIFI_EVENT_STA_DISCONNECTED reason */

/* CSI-frame observability. Incremented from wifi_csi_rx_cb, read by the
   reconnect task for periodic "alive" logging. Single-word updates, no mutex. */
static volatile uint32_t s_csi_frames_total    = 0;  /* callback invocations */
static volatile uint32_t s_csi_frames_accepted = 0;  /* passed BSSID filter */
static volatile uint32_t s_csi_frames_dropped  = 0;  /* stream buffer full  */

/* Byte stream buffer connecting the CSI callback (producer) to the writer
   task (consumer). Sized to hold ~10 full CSV rows so short network stalls
   don't drop frames while still bounding RAM. A blocking send() now only
   ever stalls the writer task, never the Wi-Fi task. */
#define CSI_STREAM_BUF_BYTES   8192
static StreamBufferHandle_t s_tx_stream = NULL;

/* ── TCP helpers ─────────────────────────────────────────────────────────── */

/**
 * Open a blocking TCP connection to the capture host.
 * Returns the socket fd on success, -1 on failure.
 */
static int tcp_connect(void)
{
    struct sockaddr_in dest = {
        .sin_family = AF_INET,
        .sin_port   = htons(CONFIG_CSI_TCP_PORT),
    };

    if (inet_pton(AF_INET, CONFIG_CSI_TCP_HOST, &dest.sin_addr) != 1) {
        ESP_LOGE(TAG, "Invalid host IP: %s", CONFIG_CSI_TCP_HOST);
        return -1;
    }

    int sock = socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
    if (sock < 0) {
        ESP_LOGE(TAG, "socket() failed: errno %d", errno);
        return -1;
    }

    /* Keep-alive so the OS detects a dead connection.
       The default lwIP idle (~2 h) is useless for an overnight 100 Hz stream
       where the capture host could suspend its Wi-Fi at any moment. Tight
       values guarantee we notice a dead peer within ~idle + intvl * cnt
       = 5 + 2*3 = 11 s and trigger reconnect instead of silently piling
       bytes into kernel send buffers. */
    int keep = 1;
    setsockopt(sock, SOL_SOCKET, SO_KEEPALIVE, &keep, sizeof(keep));
    int keep_idle  = 5;   /* seconds of idle before probes start */
    int keep_intvl = 2;   /* seconds between probes */
    int keep_cnt   = 3;   /* dead after this many missed probes */
    setsockopt(sock, IPPROTO_TCP, TCP_KEEPIDLE,  &keep_idle,  sizeof(keep_idle));
    setsockopt(sock, IPPROTO_TCP, TCP_KEEPINTVL, &keep_intvl, sizeof(keep_intvl));
    setsockopt(sock, IPPROTO_TCP, TCP_KEEPCNT,   &keep_cnt,   sizeof(keep_cnt));

