maybecat-wow/esp32-breathing/main/app_main.c
    s_csi_frames_total++;

    if (memcmp(info->mac, ctx, 6)) {
        return;
    }

    s_csi_frames_accepted++;

    /* Drop frame if no stream buffer (early boot) or not yet connected.
       Checking s_tcp_sock is a plain int read — worst case we build a
       line and push it to the queue, the writer task sees sock<0 and
       discards on dequeue. We never take s_tcp_mutex here — the whole
       point of the queue is to keep the Wi-Fi task off that lock. */
    if (s_tx_stream == NULL) return;

    const wifi_pkt_rx_ctrl_t *rx_ctrl = &info->rx_ctrl;
    static int s_count = 0;
    float compensate_gain = 1.0f;
    static uint8_t agc_gain = 0;
    static int8_t  fft_gain = 0;

#if CONFIG_GAIN_CONTROL
    static uint8_t agc_gain_baseline = 0;
    static int8_t  fft_gain_baseline = 0;
    esp_csi_gain_ctrl_get_rx_gain(rx_ctrl, &agc_gain, &fft_gain);
    if (s_count < 100) {
        esp_csi_gain_ctrl_record_rx_gain(agc_gain, fft_gain);
    } else if (s_count == 100) {
        esp_csi_gain_ctrl_get_rx_gain_baseline(&agc_gain_baseline, &fft_gain_baseline);
#if CONFIG_FORCE_GAIN
        esp_csi_gain_ctrl_set_rx_force_gain(agc_gain_baseline, fft_gain_baseline);
        ESP_LOGI(TAG, "fft_force %d, agc_force %d", fft_gain_baseline, agc_gain_baseline);
#endif
    }
    esp_csi_gain_ctrl_get_gain_compensation(&compensate_gain, agc_gain, fft_gain);
    ESP_LOGD(TAG, "compensate_gain %f, agc_gain %d, fft_gain %d",
             compensate_gain, agc_gain, fft_gain);
#endif

    /* Build the CSV line into a stack buffer. The whole line is built
       entirely before we touch the stream buffer — so we only enqueue
       once per frame, atomically, and the consumer never sees a torn
       row even under back-pressure. */
    char buf[TCP_TX_BUF_SIZE];
    int  pos = 0;

    /* ── CSI_DATA row — metadata fields ── */
#if CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C61
    pos += snprintf(buf + pos, sizeof(buf) - pos,
        "CSI_DATA,%d," MACSTR ",%d,%d,%d,%d,%d,%d,%d,%d,%d",
        s_count, MAC2STR(info->mac),
        rx_ctrl->rssi, rx_ctrl->rate,
        rx_ctrl->noise_floor, fft_gain, agc_gain,
        rx_ctrl->channel, rx_ctrl->timestamp,
        rx_ctrl->sig_len, rx_ctrl->rx_state);
#else
    pos += snprintf(buf + pos, sizeof(buf) - pos,
        "CSI_DATA,%d," MACSTR ",%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d",
        s_count, MAC2STR(info->mac),
        rx_ctrl->rssi, rx_ctrl->rate, rx_ctrl->sig_mode,
        rx_ctrl->mcs, rx_ctrl->cwb, rx_ctrl->smoothing,
        rx_ctrl->not_sounding, rx_ctrl->aggregation,
        rx_ctrl->stbc, rx_ctrl->fec_coding, rx_ctrl->sgi,
        rx_ctrl->noise_floor, rx_ctrl->ampdu_cnt,
        rx_ctrl->channel, rx_ctrl->secondary_channel,
        rx_ctrl->timestamp, rx_ctrl->ant,
        rx_ctrl->sig_len, rx_ctrl->rx_state);
#endif

    /* ── CSI data array ── */
#if (CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C61) && CSI_FORCE_LLTF
    int16_t csi_val = (int16_t)(((((uint16_t)info->buf[1]) << 8) | info->buf[0]) << 4) >> 4;
    pos += snprintf(buf + pos, sizeof(buf) - pos,
        ",%d,%d,\"[%d",
        (info->len - 2) / 2, info->first_word_invalid,
        (int16_t)(compensate_gain * csi_val));

    for (int i = 2; i < (info->len - 2); i += 2) {
        if (pos > TCP_TX_BUF_SIZE - 12) break;   /* drop rest of row if line would overflow */
        csi_val = (int16_t)(((((uint16_t)info->buf[i+1]) << 8) | info->buf[i]) << 4) >> 4;
        pos += snprintf(buf + pos, sizeof(buf) - pos,
            ",%d", (int16_t)(compensate_gain * csi_val));
    }
#else
    pos += snprintf(buf + pos, sizeof(buf) - pos,
        ",%d,%d,\"[%d",
        info->len, info->first_word_invalid,
        (int16_t)(compensate_gain * info->buf[0]));

    for (int i = 1; i < info->len; i++) {
        if (pos > TCP_TX_BUF_SIZE - 12) break;
        pos += snprintf(buf + pos, sizeof(buf) - pos,
            ",%d", (int16_t)(compensate_gain * info->buf[i]));
    }
#endif

    /* ── Close the array and row ── */
    pos += snprintf(buf + pos, sizeof(buf) - pos, "]\"\n");

    /* Non-blocking push to the writer task. If the stream buffer is full
       (writer stalled / TCP back-pressured) we drop this frame rather
       than stall the Wi-Fi task. Matches the overnight-capture contract:
       "occasional dropped frames OK, disassoc not OK". */
    size_t sent = xStreamBufferSend(s_tx_stream, buf, pos, 0);
    if (sent != (size_t)pos) {
        s_csi_frames_dropped++;
    }
    s_count++;
}

/* ── Wi-Fi CSI init ──────────────────────────────────────────────────────── */

static void wifi_csi_init(void)
{
#if CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C61
    wifi_csi_config_t csi_config = {
        .enable                   = true,
        .acquire_csi_legacy       = true,
        .acquire_csi_force_lltf   = CSI_FORCE_LLTF,
        .acquire_csi_ht20         = true,
        .acquire_csi_ht40         = true,
        .acquire_csi_vht          = false,
        .acquire_csi_su           = false,
        .acquire_csi_mu           = false,
        .acquire_csi_dcm          = false,
        .acquire_csi_beamformed   = false,
        .acquire_csi_he_stbc_mode = 2,
        .val_scale_cfg            = 0,
        .dump_ack_en              = false,
        .reserved                 = false
    };
#elif CONFIG_IDF_TARGET_ESP32C6
    wifi_csi_config_t csi_config = {
        .enable                 = true,
        .acquire_csi_legacy     = true,
        .acquire_csi_ht20       = true,
        .acquire_csi_ht40       = true,
        .acquire_csi_su         = false,
        .acquire_csi_mu         = false,
        .acquire_csi_dcm        = false,
        .acquire_csi_beamformed = false,
        .acquire_csi_he_stbc    = 2,
        .val_scale_cfg          = false,
        .dump_ack_en            = false,
        .reserved               = false
    };
#else
    wifi_csi_config_t csi_config = {
        .lltf_en           = true,
        .htltf_en          = false,
        .stbc_htltf2_en    = false,
        .ltf_merge_en      = true,
        .channel_filter_en = true,
        .manu_scale        = true,
        .shift             = true,
    };
#endif

    static wifi_ap_record_t s_ap_info = {0};
    ESP_ERROR_CHECK(esp_wifi_sta_get_ap_info(&s_ap_info));
    ESP_ERROR_CHECK(esp_wifi_set_csi_config(&csi_config));
    ESP_ERROR_CHECK(esp_wifi_set_csi_rx_cb(wifi_csi_rx_cb, s_ap_info.bssid));
    ESP_ERROR_CHECK(esp_wifi_set_csi(true));
}

