maybecat-wow/esp32-breathing/main/app_main.c
/* ── Ping router (generates the CSI traffic) ─────────────────────────────── */

static esp_err_t wifi_ping_router_start(void)
{
    static esp_ping_handle_t ping_handle = NULL;

    esp_ping_config_t ping_config = ESP_PING_DEFAULT_CONFIG();
    ping_config.count           = 0;
    ping_config.interval_ms     = 1000 / CONFIG_SEND_FREQUENCY;
    ping_config.task_stack_size = 3072;
    ping_config.data_size       = 1;

    esp_netif_ip_info_t local_ip;
    esp_netif_get_ip_info(esp_netif_get_handle_from_ifkey("WIFI_STA_DEF"), &local_ip);
    ESP_LOGI(TAG, "got ip:" IPSTR ", gw: " IPSTR,
             IP2STR(&local_ip.ip), IP2STR(&local_ip.gw));

    ping_config.target_addr.u_addr.ip4.addr = ip4_addr_get_u32(&local_ip.gw);
    ping_config.target_addr.type = ESP_IPADDR_TYPE_V4;

    esp_ping_callbacks_t cbs = {0};
    esp_ping_new_session(&ping_config, &cbs, &ping_handle);
    esp_ping_start(ping_handle);

    return ESP_OK;
}

/* ── Wi-Fi provisioning (ESPTouch) ──────────────────────────────────────── */

#define NVS_NAMESPACE   "wifi_creds"
#define NVS_KEY_SSID    "ssid"
#define NVS_KEY_PASS    "password"

#define WIFI_CONNECTED_BIT  BIT0
#define WIFI_FAIL_BIT       BIT1
#define ESPTOUCH_DONE_BIT   BIT2

static EventGroupHandle_t s_wifi_event_group;
static bool s_has_stored_creds  = false;
/* Latched true on first successful IP_EVENT_STA_GOT_IP and never cleared.
   Used to prevent NVS credential erasure after a mid-night disconnect —
   overnight glitches must not disable the sensor until morning. */
static bool s_ever_connected    = false;
static int  s_auth_fail_count   = 0;   /* consecutive auth-class failures before first association */
static int  s_reconnect_attempt = 0;   /* exponential-backoff counter, reset on GOT_IP */
static esp_timer_handle_t s_wifi_reconnect_timer = NULL;

/* Helpers for the reason-aware disconnect policy. */
static bool wifi_reason_is_auth(int reason)
{
    switch (reason) {
        case WIFI_REASON_AUTH_FAIL:
        case WIFI_REASON_AUTH_EXPIRE:
        case WIFI_REASON_HANDSHAKE_TIMEOUT:
        case WIFI_REASON_MIC_FAILURE:
        case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT:
            return true;
        default:
            return false;
    }
}

static void wifi_reconnect_timer_cb(void *arg)
{
    esp_err_t err = esp_wifi_connect();
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "esp_wifi_connect() in backoff cb: %s", esp_err_to_name(err));
    }
}

/* Schedule the next esp_wifi_connect() after `delay_ms` without blocking
   the default event loop task. Creates the one-shot timer on first use. */
static void wifi_schedule_reconnect(uint32_t delay_ms)
{
    if (s_wifi_reconnect_timer == NULL) {
        const esp_timer_create_args_t args = {
            .callback = &wifi_reconnect_timer_cb,
            .name     = "wifi_reconn",
        };
        if (esp_timer_create(&args, &s_wifi_reconnect_timer) != ESP_OK) {
            /* Fall back to an immediate connect; worst case the next
               disconnect schedules it again. */
            esp_wifi_connect();
            return;
        }
    }
    esp_timer_stop(s_wifi_reconnect_timer);   /* harmless if not armed */
    esp_timer_start_once(s_wifi_reconnect_timer, (uint64_t)delay_ms * 1000);
}

static bool load_wifi_credentials(char *ssid, size_t ssid_len,
                                   char *password, size_t pass_len)
{
    nvs_handle_t h;
    if (nvs_open(NVS_NAMESPACE, NVS_READONLY, &h) != ESP_OK) return false;
    bool ok = (nvs_get_str(h, NVS_KEY_SSID, ssid, &ssid_len) == ESP_OK &&
               nvs_get_str(h, NVS_KEY_PASS, password, &pass_len) == ESP_OK);
    nvs_close(h);
    return ok;
}

static void save_wifi_credentials(const char *ssid, const char *password)
{
    nvs_handle_t h;
    if (nvs_open(NVS_NAMESPACE, NVS_READWRITE, &h) != ESP_OK) return;
    nvs_set_str(h, NVS_KEY_SSID, ssid);
    nvs_set_str(h, NVS_KEY_PASS, password);
    nvs_commit(h);
    nvs_close(h);
}

static void erase_wifi_credentials(void)
{
    nvs_handle_t h;
    if (nvs_open(NVS_NAMESPACE, NVS_READWRITE, &h) != ESP_OK) return;
    nvs_erase_key(h, NVS_KEY_SSID);
    nvs_erase_key(h, NVS_KEY_PASS);
    nvs_commit(h);
    nvs_close(h);
}

static void smartconfig_task(void *parm)
{
    ESP_LOGI(TAG, "Starting ESPTouch provisioning — open the EspTouch app now");
    ESP_ERROR_CHECK(esp_smartconfig_set_type(SC_TYPE_ESPTOUCH));
    smartconfig_start_config_t cfg = SMARTCONFIG_START_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_smartconfig_start(&cfg));

    xEventGroupWaitBits(s_wifi_event_group,
                        ESPTOUCH_DONE_BIT | WIFI_FAIL_BIT,
                        true, false, portMAX_DELAY);

    ESP_LOGI(TAG, "ESPTouch provisioning complete");
    esp_smartconfig_stop();
    vTaskDelete(NULL);
}

static void wifi_event_handler(void *arg, esp_event_base_t event_base,
                               int32_t event_id, void *event_data)
{
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        if (s_has_stored_creds) {
            esp_wifi_connect();
        } else {
            xTaskCreate(smartconfig_task, "smartconfig", 4096, NULL, 3, NULL);
        }

    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        wifi_event_sta_disconnected_t *ev =
            (wifi_event_sta_disconnected_t *)event_data;
        int reason = ev ? ev->reason : 0;

        /* Publish the reason so the heartbeat line can report it. The 64-bit
           s_last_tx_us and this 32-bit field are both read under s_tcp_mutex
           from the reconnect task, but the write here is a single-word store
           that any reader will either see old or new — either is fine. */
        s_last_disc_reason = reason;

        /* Compute exponential backoff: 500 ms, 1 s, 2 s, … capped at 30 s.
           Reset to zero on GOT_IP. */
        uint32_t delay_ms = WIFI_RECONNECT_BACKOFF_MIN_MS
                            << (s_reconnect_attempt < 6 ? s_reconnect_attempt : 6);
        if (delay_ms > WIFI_RECONNECT_BACKOFF_MAX_MS) {
            delay_ms = WIFI_RECONNECT_BACKOFF_MAX_MS;
        }
        s_reconnect_attempt++;

