maybecat-wow/esp32-breathing/main/app_main.c
        if (s_ever_connected) {
            /* Once we've been online, NEVER erase credentials and NEVER give
               up — unattended overnight use must survive AP reboots, DFS
               radar switches, channel hops, host laptop sleeping its Wi-Fi,
               etc. Just keep retrying with backoff forever. */
            ESP_LOGW(TAG, "WiFi disconnected (reason %d) — retry in %lu ms",
                     reason, (unsigned long)delay_ms);
            wifi_schedule_reconnect(delay_ms);
        } else if (wifi_reason_is_auth(reason)) {
            /* Auth-class failures during the *initial* association are the
               only situation where we erase NVS and fall back to ESPTouch —
               this catches truly-bad stored credentials. Requires several in
               a row so a one-off handshake glitch doesn't trigger it. */
            s_auth_fail_count++;
            ESP_LOGW(TAG, "WiFi auth failure %d/%d (reason %d) during initial connect",
                     s_auth_fail_count, WIFI_AUTH_FAIL_THRESHOLD, reason);
            if (s_auth_fail_count >= WIFI_AUTH_FAIL_THRESHOLD) {
                ESP_LOGE(TAG, "Stored credentials rejected — will erase and re-provision");
                xEventGroupSetBits(s_wifi_event_group, WIFI_FAIL_BIT);
            } else {
                wifi_schedule_reconnect(delay_ms);
            }
        } else {
            /* Non-auth failures during the initial connect (AP not found,
               beacon timeout, …) — keep trying forever. The AP might just be
               slow to come up after a power cycle. */
            ESP_LOGW(TAG, "WiFi initial connect failed (reason %d) — retry in %lu ms",
                     reason, (unsigned long)delay_ms);
            wifi_schedule_reconnect(delay_ms);
        }

    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t *event = (ip_event_got_ip_t *)event_data;
        ESP_LOGI(TAG, "Got IP: " IPSTR, IP2STR(&event->ip_info.ip));
        s_reconnect_attempt = 0;
        s_auth_fail_count   = 0;
        s_ever_connected    = true;
        s_reconnect_count++;
        xEventGroupSetBits(s_wifi_event_group, WIFI_CONNECTED_BIT);

    } else if (event_base == SC_EVENT && event_id == SC_EVENT_SCAN_DONE) {
        ESP_LOGI(TAG, "ESPTouch: scan done");

    } else if (event_base == SC_EVENT && event_id == SC_EVENT_FOUND_CHANNEL) {
        ESP_LOGI(TAG, "ESPTouch: found channel");

    } else if (event_base == SC_EVENT && event_id == SC_EVENT_GOT_SSID_PSWD) {
        smartconfig_event_got_ssid_pswd_t *evt =
            (smartconfig_event_got_ssid_pswd_t *)event_data;

        wifi_config_t wifi_config = {0};
        memcpy(wifi_config.sta.ssid,     evt->ssid,     sizeof(wifi_config.sta.ssid));
        memcpy(wifi_config.sta.password, evt->password, sizeof(wifi_config.sta.password));
        wifi_config.sta.listen_interval = 1;
        if (evt->bssid_set) {
            wifi_config.sta.bssid_set = true;
            memcpy(wifi_config.sta.bssid, evt->bssid, sizeof(wifi_config.sta.bssid));
        }

        ESP_LOGI(TAG, "ESPTouch: got SSID \"%s\"", (char *)evt->ssid);
        save_wifi_credentials((char *)evt->ssid, (char *)evt->password);

        ESP_ERROR_CHECK(esp_wifi_disconnect());
        ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
        esp_wifi_connect();

    } else if (event_base == SC_EVENT && event_id == SC_EVENT_SEND_ACK_DONE) {
        xEventGroupSetBits(s_wifi_event_group, ESPTOUCH_DONE_BIT);
    }
}

static void wifi_init(void)
{
    s_wifi_event_group = xEventGroupCreate();

    esp_netif_create_default_wifi_sta();

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));
    ESP_ERROR_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));

    ESP_ERROR_CHECK(esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                               &wifi_event_handler, NULL));
    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, IP_EVENT_STA_GOT_IP,
                                               &wifi_event_handler, NULL));
    ESP_ERROR_CHECK(esp_event_handler_register(SC_EVENT, ESP_EVENT_ANY_ID,
                                               &wifi_event_handler, NULL));

    /* Load stored credentials if available */
    char ssid[32] = {0}, password[64] = {0};
    if (load_wifi_credentials(ssid, sizeof(ssid), password, sizeof(password))) {
        ESP_LOGI(TAG, "Found stored credentials for \"%s\", connecting…", ssid);
        wifi_config_t wifi_config = {0};
        memcpy(wifi_config.sta.ssid,     ssid,     sizeof(wifi_config.sta.ssid));
        memcpy(wifi_config.sta.password, password, sizeof(wifi_config.sta.password));
        /* Advertise listen_interval=1 so AP treats STA as always-listening.
           Default (CONFIG_ESP_WIFI_STA_LISTEN_INTERVAL=3) confuses some APs
           even when PS is disabled, and they deprioritize us. */
        wifi_config.sta.listen_interval = 1;
        ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
        s_has_stored_creds = true;
    } else {
        ESP_LOGI(TAG, "No stored credentials — will use ESPTouch");
    }

    ESP_ERROR_CHECK(esp_wifi_start());

    /* Disable Wi-Fi power save. The default WIFI_PS_MIN_MODEM sleeps between
       beacons with listen_interval > 1, causing bcn_timeout / TBTT-delay
       storms under a sustained 100 Hz CSI workload. A missed beacon marks
       the link dead and send() returns EHOSTUNREACH (errno 113) until the
       STA re-associates. Keep the radio fully on. */
    ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE));

    /* Extend the STA inactive time from the default 10 s to 30 s. This is
       the beacon-loss watchdog: if no beacon is received within this many
       seconds, the STA disassociates. With CSI at 50+ Hz the radio
       occasionally misses a short run of beacons due to TX/RX contention;
       the default triggers disassoc → EHOSTUNREACH on the TCP socket every
       ~11 s. 30 s is the max permitted. */
    ESP_ERROR_CHECK(esp_wifi_set_inactive_time(WIFI_IF_STA, 30));

    /* Block until we get an IP, or stored credentials are rejected as bad.
       WIFI_FAIL_BIT is now set ONLY after WIFI_AUTH_FAIL_THRESHOLD consecutive
       auth-class failures before the first successful association — so a
       flaky AP that eventually comes back won't trigger credential erasure. */
    EventBits_t bits = xEventGroupWaitBits(s_wifi_event_group,
                                           WIFI_CONNECTED_BIT | WIFI_FAIL_BIT,
                                           false, false, portMAX_DELAY);

    if (bits & WIFI_FAIL_BIT) {
        ESP_LOGE(TAG, "Stored credentials look genuinely bad — erasing and restarting");
        erase_wifi_credentials();
        esp_restart();
    }
}

/* ── app_main ────────────────────────────────────────────────────────────── */

