maybecat-wow/esp32-breathing/main/app_main.c
void app_main(void)
{
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    wifi_init();

    /* Create the mutex before the CSI callback can fire */
    s_tcp_mutex = xSemaphoreCreateMutex();
    configASSERT(s_tcp_mutex);

    /* Stream buffer connecting wifi-task (producer) → writer task (consumer).
       Must exist before CSI callback fires or frames are dropped silently. */
    s_tx_stream = xStreamBufferCreate(CSI_STREAM_BUF_BYTES, 1);
    configASSERT(s_tx_stream);

    /* Writer task — drains the stream and performs the only blocking send()
       in the system. Higher priority than reconnect task (must drain promptly)
       but lower than Wi-Fi task so it can't starve beacon handling. */
    xTaskCreate(tcp_writer_task, "tcp_writer", 4096, NULL, 5, NULL);

    /* Reconnect task — runs at low priority, wakes every 200 ms */
    xTaskCreate(tcp_reconnect_task, "tcp_reconnect", 4096, NULL, 3, NULL);

    /* Give the reconnect task time to establish the first connection
       before CSI frames start arriving */
    ESP_LOGI(TAG, "Waiting for TCP connection to %s:%d …",
             CONFIG_CSI_TCP_HOST, CONFIG_CSI_TCP_PORT);
    for (int i = 0; i < 20; i++) {
        xSemaphoreTake(s_tcp_mutex, portMAX_DELAY);
        bool ok = (s_tcp_sock >= 0);
        xSemaphoreGive(s_tcp_mutex);
        if (ok) break;
        vTaskDelay(pdMS_TO_TICKS(500));
    }

    wifi_csi_init();
    wifi_ping_router_start();
}
